### Practical

In [1]:
import pandas as pd

In [2]:
States = pd.read_csv("data.csv")

In [6]:
#Load a small CSV and print first 5 rows
print(States)

print(States.head(2))

      Name  Age  Salary
0    Alice   22   50000
1      Bob   30   60000
2  Charlie   28   55000
3    David   35   34000
4  Zeeshan   30  200000
5    Ahmed   21   30000
    Name  Age  Salary
0  Alice   22   50000
1    Bob   30   60000

In [14]:
States.isnull().sum()

Name      0
Age       0
Salary    0
dtype: int64

In [24]:
States.shape
States.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   Salary  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 276.0+ bytes

In [27]:
States.dtypes

Name      object
Age        int64
Salary     int64
dtype: object

In [31]:
States["Age"].describe()
States.describe()

             Age         Salary
count   6.000000       6.000000
mean   27.666667   71500.000000
std     5.316641   64042.954335
min    21.000000   30000.000000
25%    23.500000   38000.000000
50%    29.000000   52500.000000
75%    30.000000   58750.000000
max    35.000000  200000.000000